---
kind: type
id: T:Autodesk.Revit.UI.Selection.ObjectSnapTypes
source: html/806b68f7-9801-f58e-ee3e-94b85bfaea8f.htm
---
# Autodesk.Revit.UI.Selection.ObjectSnapTypes

This enumerated type contains object snap types allowed to be set during PickPoint operations.

## Syntax (C#)
```csharp
[FlagsAttribute]
public enum ObjectSnapTypes
```